dict = {"中国":{"北京市":{"昌平区":{"沙河镇":{"七马路":{"育荣教育园区":"狼腾测试"}}}}},
        "中国":{"秦皇岛市":{"北戴河区":{"金港大道":{"河环院":{"邢伟":"小伟"}}}}},
        "中国":{"秦皇岛市":{"山海关区":{"龙海大道":{"山海关风景区":{"邢伟":"小伟"}}}}}}
中国 = input("请输入您的地名")
if 中国=="中国":
    秦皇岛市=input("请输入您的地名")
if 秦皇岛市=="秦皇岛市":
    北戴河区= input("请输入您的地名")
if  北戴河区== "北戴河区":
    金港大道 = input("请输入您的地名")
if  金港大道 == "金港大道":
    河环院 = input("请输入您的地名")
if  河环院 == "河环院":
    邢伟 = input("请输入您的地名")
if  邢伟 == "邢伟":
    print(dict [中国][秦皇岛市][北戴河区][金港大道][河环院][邢伟])
中国 = input("请输入您的地名")
if 中国=="中国":
   秦皇岛市=input("请输入您的地名")
if 秦皇岛市=="秦皇岛市":
    山海关区= input("请输入您的地名")
if  山海关区== "山海关区":
    龙海大道 = input("请输入您的地名")
if  龙海大道 == "龙海大道":
    山海关风景区 = input("请输入您的地名")
if  山海关风景区 == "山海关风景区":
    邢伟 = input("请输入您的地名")
if  邢伟 == "邢伟":
    print(dict [中国][秦皇岛市][山海关区][龙海大道][山海关风景区][邢伟])
中国 = input("请输入您的地名")
if 中国=="中国":
    北京市=input("请输入您的地名")
if 北京市=="北京市":
    昌平区= input("请输入您的地名")
if  昌平区== "昌平区":
    沙河镇 = input("请输入您的地名")
if  沙河镇 == "沙河镇":
    七马路 = input("请输入您的地名")
if  七马路 == "七马路":
    育荣教育园区 = input("请输入您的地名")
if  育荣教育园区 == "育荣教育园区":
    print(dict [中国][北京市][昌平区][沙河镇][七马路][育荣教育园区])
